homework/hw1.org
#+TITLE: PPL -- Homework 1
#+SETUPFILE: ../setup.org

-----

#+BEGIN_abstract
Enter the concepts of compilation and interpretation.
#+END_abstract

1. (*30 points*) Write a detailed evaluation of a programming language
   you know, using and covering the criteria discussed in class, i.e.,
   readability, writability, reliability, cost, portability.
2. (*15 points*) Name and explain /another criterion/ to judge languages.
3. (*15 points*) What are the advantages in implementing a language
   with a pure interpreter?
4. (*15 points*) Some programming languages, for example, Python, use
   semicolon to /separate/ statements (which means that it is optional
   if only one statement per line), while C/C++ uses it to /terminate/
   statements.  Which of these, in your opinion, is most natural and
   least likely to result in syntax errors?  Support your answer.
5. (*10 points*) Describe some design trade-offs between efficiency
   and safety in some language you know.
6. (*15 points*) Explain two reasons why pure interpretation is an
   acceptable implementation method for several recent scripting
   languages.

-----
