hw1/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-08-16 Sun 20:22 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>PPL &#x2013; Homework 1</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<meta name="description" content="COMP 3220 Principle of Programming Languages, Auburn University">
<meta name="keywords" content="comp3220, principle of programming languages, auburn university">
<link rel="stylesheet" href="/comp3220/css/normalize.css" type="text/css" />
<link rel="stylesheet" href="/comp3220/css/font-awesome.min.css" type="text/css" />
<link rel="stylesheet" href="https://gongzhitaao.github.io/orgcss/org.css" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">PPL &#x2013; Homework 1</h1>
</header><hr >

<div class="abstract">
<p>
Enter the concepts of compilation and interpretation.
</p>

</div>

<ol class="org-ol">
<li>(<b>30 points</b>) Write a detailed evaluation of a programming language
you know, using and covering the criteria discussed in class, i.e.,
readability, writability, reliability, cost, portability.</li>
<li>(<b>15 points</b>) Name and explain <i>another criterion</i> to judge languages.</li>
<li>(<b>15 points</b>) What are the advantages in implementing a language
with a pure interpreter?</li>
<li>(<b>15 points</b>) Some programming languages, for example, Python, use
semicolon to <i>separate</i> statements (which means that it is optional
if only one statement per line), while C/C++ uses it to <i>terminate</i>
statements.  Which of these, in your opinion, is most natural and
least likely to result in syntax errors?  Support your answer.</li>
<li>(<b>10 points</b>) Describe some design trade-offs between efficiency
and safety in some language you know.</li>
<li>(<b>15 points</b>) Explain two reasons why pure interpretation is an
acceptable implementation method for several recent scripting
languages.</li>
</ol>
</div>
<div id="postamble" class="status">
<a class="author"
       href="http://gongzhitaao.org">Zhitao Gong</a> / <span
       class="date">2015-08-16 Sun 20:22</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3.1)</span>
</div>
</body>
</html>
